In [1]:
import pandas as pd
import numpy as np 
df = pd.read_csv('./movies.csv')
df1 = df.drop('genres',1)
df1.head()

   movieId                               title
0        1                    Toy Story (1995)
1        2                      Jumanji (1995)
2        3             Grumpier Old Men (1995)
3        4            Waiting to Exhale (1995)
4        5  Father of the Bride Part II (1995)

# get_dummies()

### Convert categorical variable into dummy/indicator variables.将类别变量转化为0,1

In [6]:
s = pd.Series(list('abca'))
s

0    a
1    b
2    c
3    a
dtype: object

In [13]:
pd.get_dummies(s)

   a  b  c
0  1  0  0
1  0  1  0
2  0  0  1
3  1  0  0

In [16]:
s1 = ['a','b',np.nan]
pd.get_dummies(s1)

   a  b
0  1  0
1  0  1
2  0  0

In [18]:
df = pd.DataFrame({'A': ['a', 'b', 'a'], 'B': ['b', 'a', 'c'],
                   'C': [1, 2, 3]})
df

   A  B  C
0  a  b  1
1  b  a  2
2  a  c  3

In [22]:
pd.get_dummies(df,prefix=['col1','col2'])

   C  col1_a  col1_b  col2_a  col2_b  col2_c
0  1       1       0       0       1       0
1  2       0       1       1       0       0
2  3       1       0       0       0       1

# Series.str.get_dummies(self, sep='|')[source]¶
### Split each string in the Series by sep and return a DataFrame of dummy/indicator variables.

In [12]:
df.genres.str.get_dummies(sep='|').head()

,(no genres listed),Action,Adventure,Animation,Children,Comedy,Crime,Documentary,Drama,Fantasy,Film-Noir,Horror,IMAX,Musical,Mystery,Romance,Sci-Fi,Thriller,War,Western
0,0,0,1,1,1,1,0,0,0,1,0,0,0,0,0,0,0,0,0,0
1,0,0,1,0,1,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0
2,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,1,0,0,0,0
3,0,0,0,0,0,1,0,0,1,0,0,0,0,0,0,1,0,0,0,0
4,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0

In [15]:
import numpy as np 
pd.Series(['a_b',np.nan,'c_b']).str.get_dummies(sep='_')

   a  b  c
0  1  1  0
1  0  0  0
2  0  1  1

# join()方法

### Python join() 方法用于将序列中的元素以指定的字符连接生成一个新的字符串。

In [25]:
# str.join(sequence)
# https://www.runoob.com/python3/python3-string-join.html

# pandas join()方法

### https://pandas.pydata.org/pandas-docs/stable/user_guide/merging.html#concatenating-objects

In [ ]:
pd.option.display.max_columns=100